In [1]:
import pandas as pd
import xlwings as xw

In [2]:
data = [['Mark', 55, 'Italy', '4.5', 'Europe'], ['John', 33, 'USA', 6.7, 'America']]
df = pd.DataFrame(data=data, columns=['name', 'age', 'country', 'score', 'continent'], index=[1001, 1000])
df.index.name = 'user_id'
df

         name  age country score continent
user_id
1001     Mark   55   Italy   4.5    Europe
1000     John   33     USA   6.7   America

In [3]:
book = xw.Book()
sheet1 = book.sheets[0]

### Write dataframes into excel

In [4]:
# insert df with headers and index
sheet1['A6'].value = df

In [5]:
# insert df without headers or index
sheet1['B10'].options(header=False, index=False).value = df

### Read excel to dataframes

In [6]:
df2 = sheet1['A6'].expand().options(pd.DataFrame).value
df2

         name   age country  score continent
user_id
1001.0   Mark  55.0   Italy    4.5    Europe
1000.0   John  33.0     USA    6.7   America

In [7]:
# index to be integer
df2.index = df2.index.astype(int)
df2

         name   age country  score continent
user_id
1001     Mark  55.0   Italy    4.5    Europe
1000     John  33.0     USA    6.7   America

In [8]:
# By setting index=False, it will put all the values from Excel into the data part of the DataFrame
# and will use the default index
sheet1['A6'].expand().options(pd.DataFrame, index=False).value

   user_id  name   age country  score continent
0   1001.0  Mark  55.0   Italy    4.5    Europe
1   1000.0  John  33.0     USA    6.7   America